package chap3;

public class BitLogicExample {

	public static void main(String[] args) {
		
		//비트 논리 연산사
		
		System.out.println("45&25="+(45&25));
		System.out.println("45&25="+(45|25));
		System.out.println("45&25="+(45^25));
		System.out.println("~45="+~45);
		// 10진수 45 -> 2진수 00101101
		// 10진수 25 -> 2진수 00011001
		// (101101) & (011001) -> (001001) -> 10진수 9
		// (101101) | (011001) -> (111101) -> 10진수 61
		// (101101) ^ (011001) -> (110100) -> 10진수 52
		// ~(00101101)-> (11010010)-> (1)(1010010) -> 
		// 1의보수->(1)(0101101)-> +1 -> (1)(0101110) -> -46
		
		
		
	}

}
